<main class="main-container ng-scope" ng-view=""><div class="main receptacle post-view ng-scope"><article class="entry ng-scope" ng-controller="EntryCtrl" ui-lightbox=""><header><h1 class="entry-title ng-binding">学习/认识CPU的GDT</h1><div class="entry-meta"><a target="_blank" class="author name ng-binding">correy</a> <span class="bull">·</span> <time title="2015/08/11 14:54" ui-time="" datetime="2015/08/11 14:54" class="published ng-binding ng-isolate-scope">2015/08/11 14:54</time></div></header><section class="entry-content ng-binding" ng-bind-html="postContentTrustedHtml"><p></p><h1>0x00 关于GDT</h1><hr><p>CPU相信大家都知道是啥玩意，哪三个单词缩写。GDT对于一些不搞底层的人知道的可能还有一些。</p><p>GDT就是<code>global descriptor table</code>的缩写。相应的还有个<code>local descriptor tables</code> (LDT)，这个不再此文的讨论范围内。</p><p>这在保护模式教程中经常看到，但是这和咱们程序员有啥关系呢？ <strong>1.留后门</strong></p><p>就是进入R0后设置（R3）进入R0的后门（如：调用门，中断门，任务门等）。</p><p><strong>2.了解/编写操作系统</strong></p><p>人家微软的Windows操作系统经历了很多变化，如今到了WIN10。（对于天天研究Windows的人）这对咱有意思吗？顶多认识了解和应用/利用。 好像有不少的变化（PC端）都是基于硬件的。基于软件的算法不说。</p><p><strong>3.虚拟化</strong></p><p>如：intel-VT就要设置许多段（如：cs,ss,ds,es,fs,gs等）的Base，Limit，access rights，Selectors等。</p><p>好了，废话不多进入正题。</p><h1>0x01 开始分析</h1><hr><p>以Windows系统为例进行分析。</p><pre><code>kd&gt; vertarget 
Windows XP Kernel Version 2600 (Service Pack 3) MP (1 procs) Free x86 compatible
Built by: 2600.xpsp_sp3_qfe.130704-0421
Machine Name:
Kernel base = 0x804d8000 PsLoadedModuleList = 0x8055e720
Debug session time: Thu Aug  6 14:25:16.468 2015 (UTC + 8:00)

03A0 00008003 0000f3a8 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03A8 00008003 0000f3b0 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03B0 00008003 0000f3b8 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03B8 00008003 0000f3c0 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03C0 00008003 0000f3c8 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03C8 00008003 0000f3d0 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03D0 00008003 0000f3d8 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03D8 00008003 0000f3e0 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03E0 00008003 0000f3e8 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03E8 00008003 0000f3f0 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03F0 00008003 0000f3f8 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
03F8 00000000 00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
</code></pre><p>我们的功能就是要解析出这样的格式。</p><p>注意，另外一个话题是：也可以手动分析出这个格式，如：</p><pre><code>kd&gt; r cs 
cs=00000008
</code></pre><p>然后根据一定的算法得出的结论要如下（一种思路是根据_KGDTENTRY的定义）：</p><pre><code>kd&gt; dg cs 
                                  P Si Gr Pr Lo
Sel    Base     Limit     Type    l ze an es ng Flags
---- -------- -------- ---------- - -- -- -- -- --------
0008 00000000 ffffffff Code RE Ac 0 Bg Pg P  Nl 00000c9b
</code></pre><p>这个算法就不说了，相信你会的。</p><h1>0x02 总结</h1><p>简单说下吧！</p><p>GDT就是一个（数组格式的）表，里面的每一项是一个<code>Segment Descriptors</code>。</p><p>关于这个的格式，可见： <code>Intel? 64 and IA-32 Architectures Software Developer’s Manual（Order Number: 325462-055US June 2015）</code>的 <code>Volume 3: System Programming Guide</code> 的 <code>3.4.5 Segment Descriptors</code>小节及附图。</p><p>这个Segment Descriptors具体的分两大类：</p><p>一类是：<code>application (code or data) descriptor</code>。 <code>这就是常见的代码/数据段，如：大多数的CS，DS都指向这里</code>。 一类是：<code>system descriptor</code></p><p>这里又分为：<code>system-segment descriptors（LDT and TSS segments）</code>。 <code>gate descriptors（call, interrupt, and trap gates）</code>。</p><p>但是，这些结构在Windows下的定义是啥样呢？</p><p>经查WRK和WINDBG，结果如下：</p><pre><code>// Special Registers for i386
typedef struct _X86_DESCRIPTOR {
    USHORT  Pad;
    USHORT  Limit;
    ULONG   Base;
} X86_DESCRIPTOR, *PX86_DESCRIPTOR;

// GDT Entry
typedef struct _KGDTENTRY {
    USHORT  LimitLow;
    USHORT  BaseLow;
    union {
        struct {
            UCHAR   BaseMid;
            UCHAR   Flags1;     // Declare as bytes to avoid alignment
            UCHAR   Flags2;     // Problems.
            UCHAR   BaseHi;
        } Bytes;
        struct {
            ULONG   BaseMid : 8;
            ULONG   Type : 5;//把S位包含进去了，也就是是否为系统段描述符的位。
            ULONG   Dpl : 2;
            ULONG   Pres : 1;
            ULONG   LimitHi : 4;
            ULONG   Sys : 1;//即AVL，系统软件自定义的。
            ULONG   Reserved_0 : 1;//LongMode
            ULONG   Default_Big : 1;//即INTEL的D/B (default operation size/default stack pointer size and/or upper bound) flag。
            ULONG   Granularity : 1;
            ULONG   BaseHi : 8;
        } Bits;
    } HighWord;
} KGDTENTRY, *PKGDTENTRY;
</code></pre><p>为啥定义的名字是KGDTENTRY呢？其实你想想结构的位置。 这个其实就是<code>Segment Descriptors</code>，但是定义的和INTEL的不完全一样。</p><pre><code>kd&gt; dt nt!_KGDTENTRY 
   +0x000 LimitLow         : Uint2B
   +0x002 BaseLow          : Uint2B
   +0x004 HighWord         : __unnamed
kd&gt; dt nt!_KGDTENTRY -b
   +0x000 LimitLow         : Uint2B
   +0x002 BaseLow          : Uint2B
   +0x004 HighWord         : __unnamed
      +0x000 Bytes            : __unnamed
         +0x000 BaseMid          : UChar
         +0x001 Flags1           : UChar
         +0x002 Flags2           : UChar
         +0x003 BaseHi           : UChar
      +0x000 Bits             : __unnamed
         +0x000 BaseMid          : Pos 0, 8 Bits
         +0x000 Type             : Pos 8, 5 Bits
         +0x000 Dpl              : Pos 13, 2 Bits
         +0x000 Pres             : Pos 15, 1 Bit
         +0x000 LimitHi          : Pos 16, 4 Bits
         +0x000 Sys              : Pos 20, 1 Bit
         +0x000 Reserved_0       : Pos 21, 1 Bit
         +0x000 Default_Big      : Pos 22, 1 Bit
         +0x000 Granularity      : Pos 23, 1 Bit
         +0x000 BaseHi           : Pos 24, 8 Bits
</code></pre><p>具体的算法请参见： 1.INTEL的资料。 2.WRK的算法。 3.本文的代码。</p><p>上面分析的是32位下的Windows系统，再看看64位下Windows的GDT。</p><pre><code>0: kd&gt; vertarget 
Windows 7 Kernel Version 7601 (Service Pack 1) MP (2 procs) Free x64
Built by: 7601.18869.amd64fre.win7sp1_gdr.150525-0603
Machine Name:
Kernel base = 0xfffff800`01e64000 PsLoadedModuleList = 0xfffff800`020ab730
Debug session time: Thu Aug  6 14:37:33.359 2015 (UTC + 8:00)
System Uptime: 0 days 0:13:15.757
0: kd&gt; r gdtr
gdtr=fffff80001d51000
0: kd&gt; r gdtl
gdtl=007f
0: kd&gt; db fffff80001d51000 L(007f + 1)
fffff800`01d51000  00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  ................
fffff800`01d51010  00 00 00 00 00 9b 20 00-ff ff 00 00 00 93 cf 00  ...... .........
fffff800`01d51020  ff ff 00 00 00 fb cf 00-ff ff 00 00 00 f3 cf 00  ................
fffff800`01d51030  00 00 00 00 00 fb 20 00-00 00 00 00 00 00 00 00  ...... .........
fffff800`01d51040  67 00 80 20 d5 8b 00 01-00 f8 ff ff 00 00 00 00  g.. ............
fffff800`01d51050  00 3c 00 a0 f9 f3 40 ff-00 00 00 00 00 00 00 00  .&lt;....@.........
fffff800`01d51060  ff ff 00 00 00 9a cf 00-00 00 00 00 00 00 00 00  ................
fffff800`01d51070  00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  ................
0: kd&gt; dg 0 80
                                                    P Si Gr Pr Lo
Sel        Base              Limit          Type    l ze an es ng Flags
---- ----------------- ----------------- ---------- - -- -- -- -- --------
0000 00000000`00000000 00000000`00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0008 00000000`00000000 00000000`00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0010 00000000`00000000 00000000`00000000 Code RE Ac 0 Nb By P  Lo 0000029b
0018 00000000`00000000 00000000`ffffffff Data RW Ac 0 Bg Pg P  Nl 00000c93
0020 00000000`00000000 00000000`ffffffff Code RE Ac 3 Bg Pg P  Nl 00000cfb
0028 00000000`00000000 00000000`ffffffff Data RW Ac 3 Bg Pg P  Nl 00000cf3
0030 00000000`00000000 00000000`00000000 Code RE Ac 3 Nb By P  Lo 000002fb
0038 00000000`00000000 00000000`00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0040 00000000`01d52080 00000000`00000067 TSS32 Busy 0 Nb By P  Nl 0000008b
0048 00000000`0000ffff 00000000`0000f800 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0050 ffffffff`fff9a000 00000000`00003c00 Data RW Ac 3 Bg By P  Nl 000004f3
0058 00000000`00000000 00000000`00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0060 00000000`00000000 00000000`ffffffff Code RE    0 Bg Pg P  Nl 00000c9a
0068 00000000`00000000 00000000`00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0070 00000000`00000000 00000000`00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0078 00000000`00000000 00000000`00000000 &lt;Reserved&gt; 0 Nb By Np Nl 00000000
0080 Unable to get descriptor
</code></pre><p>WRK及WINDBG的相关（验证）信息如下：</p><pre><code>// Special Registers for AMD64.
typedef struct _AMD64_DESCRIPTOR {
    USHORT  Pad[3];
    USHORT  Limit;
    ULONG64 Base;
} AMD64_DESCRIPTOR, *PAMD64_DESCRIPTOR;

typedef union _KGDTENTRY64 {
    struct {
        USHORT  LimitLow;
        USHORT  BaseLow;
        union {
            struct {
                UCHAR   BaseMiddle;
                UCHAR   Flags1;
                UCHAR   Flags2;
                UCHAR   BaseHigh;
            } Bytes;

            struct {
                ULONG   BaseMiddle : 8;
                ULONG   Type : 5;//把S位包含进去了，也就是是否为系统段描述符的位。
                ULONG   Dpl : 2;
                ULONG   Present : 1;
                ULONG   LimitHigh : 4;
                ULONG   System : 1;//即AVL，系统软件自定义的。
                ULONG   LongMode : 1;
                ULONG   DefaultBig : 1;//即INTEL的D/B (default operation size/default stack pointer size and/or upper bound) flag。
                ULONG   Granularity : 1;
                ULONG   BaseHigh : 8;
            } Bits;
        };

        //ULONG BaseUpper;
        //ULONG MustBeZero;
    };

    //ULONG64 Alignment;
} KGDTENTRY64, *PKGDTENTRY64;

0: kd&gt; dt _KGDTENTRY64
hal!_KGDTENTRY64
   +0x000 LimitLow         : Uint2B
   +0x002 BaseLow          : Uint2B
   +0x004 Bytes            : &lt;unnamed-tag&gt;
   +0x004 Bits             : &lt;unnamed-tag&gt;
   +0x008 BaseUpper        : Uint4B
   +0x00c MustBeZero       : Uint4B
   +0x000 Alignment        : Uint8B
0: kd&gt; dt _KGDTENTRY64 -b
hal!_KGDTENTRY64
   +0x000 LimitLow         : Uint2B
   +0x002 BaseLow          : Uint2B
   +0x004 Bytes            : &lt;unnamed-tag&gt;
      +0x000 BaseMiddle       : UChar
      +0x001 Flags1           : UChar
      +0x002 Flags2           : UChar
      +0x003 BaseHigh         : UChar
   +0x004 Bits             : &lt;unnamed-tag&gt;
      +0x000 BaseMiddle       : Pos 0, 8 Bits
      +0x000 Type             : Pos 8, 5 Bits
      +0x000 Dpl              : Pos 13, 2 Bits
      +0x000 Present          : Pos 15, 1 Bit
      +0x000 LimitHigh        : Pos 16, 4 Bits
      +0x000 System           : Pos 20, 1 Bit
      +0x000 LongMode         : Pos 21, 1 Bit
      +0x000 DefaultBig       : Pos 22, 1 Bit
      +0x000 Granularity      : Pos 23, 1 Bit
      +0x000 BaseHigh         : Pos 24, 8 Bits
   +0x008 BaseUpper        : Uint4B
   +0x00c MustBeZero       : Uint4B
   +0x000 Alignment        : Uint8B
</code></pre><p><strong>注意：</strong> 1.以上只分析一个CPU的情况，如果一个计算机有多个CPU要分别处理。</p><p>2.为了和WINDBG的DG命令处理/显示的相似，特意根据INTEL的Table 3-1. Code- and Data-Segment Types，制作一个字符串数组。还有待改善。</p><p>3.GetGdtLimit的这个功能没有相应的C代码，只有汇编代码（.asm文件），包括（X86和X64）。这个代码就不附带了，相信你能做到的。</p><p>最后只有代码了，请看代码：</p><pre><code>/*
功能：显示每个CPU的GDT信息。
注释：一下结构摘自WRK。

made by correy.
QQ:112426112.
homepage:http://correy.webs.com 注释：需翻墙，有的翻墙软件也打不开。

2008年夏天开始学习CPU的保护模式。
2015.01.11起稿。
2015年夏修改存档，尽管还有一些不完美的地方。
*/

#include &lt;ntifs.h&gt;
#include &lt;windef.h&gt;


#if defined(_AMD64_) || defined(_IA64_) //defined(_WIN64)

// Special Registers for AMD64.
typedef struct _AMD64_DESCRIPTOR {
    USHORT  Pad[3];
    USHORT  Limit;
    ULONG64 Base;
} AMD64_DESCRIPTOR, *PAMD64_DESCRIPTOR;

typedef union _KGDTENTRY64 {
    struct {
        USHORT  LimitLow;
        USHORT  BaseLow;
        union {
            struct {
                UCHAR   BaseMiddle;
                UCHAR   Flags1;
